Conf.Simple/src/InformationRegisters/SUI_ДанныеКодовМаркировки/SUI_ДанныеКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ДанныеКодовМаркировки</name>
  <resources>
    <name>ДанныеДляЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФоновогоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/HTTPServices/SUI_ExchangeV2/Module.bsl
#Область ОбработчикиСобытий

Функция СоставКодовМаркировокПолучитьV2(Запрос)

	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);

	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда

		Попытка

			ИдентификаторЗапроса = ДанныеЗапроса.Параметры.Получить("request_id");
			МобильноеУстройство = ДанныеЗапроса.МобильноеУстройство.Ссылка;
			
			ДанныеПоЗапросу = ДанныеПоЗапросуСоставаКМ(ИдентификаторЗапроса, МобильноеУстройство);
			
			Если ДанныеПоЗапросу = Неопределено Тогда

				КодыМаркировкиКЗапросу = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь);
				ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор;
				
				РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьЗапись(МобильноеУстройство,
					ИдентификаторЗапроса, КодыМаркировкиКЗапросу, ИдентификаторФоновогоЗадания);
				
				ПараметрыВыполнения = Новый Массив();
				ПараметрыВыполнения.Добавить(МобильноеУстройство);
				ПараметрыВыполнения.Добавить(КодыМаркировкиКЗапросу);
				ПараметрыВыполнения.Добавить(ИдентификаторЗапроса);
					
				ФоновыеЗадания.Выполнить("SUI_ОбменДаннымиСервер.ОбработатьСоставКодовМаркировокВФоне", ПараметрыВыполнения,
					ИдентификаторФоновогоЗадания);

			Иначе

				Если ДанныеПоЗапросу.Выполнено Тогда

					Результат = ДанныеПоЗапросу.Результат.Получить();
					
					Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
					Запись.МобильноеУстройство = МобильноеУстройство;
					Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
					Запись.Удалить();
	
				Иначе

					ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(
						ДанныеПоЗапросу.ИдентификаторФоновогоЗадания);

					Если ФоновоеЗадание = Неопределено ИЛИ ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
						
						ПараметрыВыполнения = Новый Массив;

						ПараметрыВыполнения.Добавить(МобильноеУстройство);
						ПараметрыВыполнения.Добавить(КодыМаркировкиКЗапросу);
						ПараметрыВыполнения.Добавить(ИдентификаторЗапроса);

						ФоновыеЗадания.Выполнить("SUI_ОбменДаннымиСервер.ОбработатьСоставКодовМаркировокВФоне",
							ПараметрыВыполнения, ДанныеПоЗапросу.ИдентификаторФоновогоЗадания);
						
					КонецЕсли;

					Результат = SUI_HTTPСервис.РезультатУспех("Коды маркировки находятся в работе");

				КонецЕсли;

			КонецЕсли;

		Исключение
			Результат = ОбработатьИсключительнуюОшибку("", ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;

	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;

	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;

	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключительнуюОшибку(КонтекстОшибки, ДанныеЗапроса, Ошибка)

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
		SUI_HTTPСервисКлиентСервер.ИмяСобытия(КонтекстОшибки), УровеньЖурналаРегистрации.Ошибка,
		Метаданные.HTTPСервисы.SUI_Exchange, ДанныеЗапроса.МобильноеУстройство.Ссылка, Ошибка);

	Возврат SUI_HTTPСервис.РезультатОшибка(Ошибка, 500);

КонецФункции

Процедура ВыполнитьЛогирование(Запрос, Ответ, ОтключитьЛогирование = Ложь)

	Если ОтключитьЛогирование Тогда
		Возврат;
	КонецЕсли;

	ПараметрыДобавленияЗаписиЛогирования = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ПараметрыДобавленияЗаписиЛогирования(
		Запрос, Ответ);

	SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДобавитьЗаписьЛогирования(ПараметрыДобавленияЗаписиЛогирования);

КонецПроцедуры

Функция ДанныеПоЗапросуСоставаКМ(ИдентификаторЗапроса, МобильноеУстройство)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_ДанныеКодовМаркировки.Результат,
	|	SUI_ДанныеКодовМаркировки.Выполнено,
	|	SUI_ДанныеКодовМаркировки.ИдентификаторФоновогоЗадания
	|ИЗ
	|	РегистрСведений.SUI_ДанныеКодовМаркировки КАК SUI_ДанныеКодовМаркировки
	|ГДЕ
	|	SUI_ДанныеКодовМаркировки.МобильноеУстройство = &МобильноеУстройство
	|	И SUI_ДанныеКодовМаркировки.УникальныйИдентификатор = &УникальныйИдентификатор";

	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ИдентификаторЗапроса);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Результат = Новый Структура;

		Результат.Вставить("Результат", ВыборкаДетальныеЗаписи.Результат);
		Результат.Вставить("Выполнено", ВыборкаДетальныеЗаписи.Выполнено);
		Результат.Вставить("ИдентификаторФоновогоЗадания", ВыборкаДетальныеЗаписи.ИдентификаторФоновогоЗадания);

		Возврат ВыборкаДетальныеЗаписи;

	Иначе

		Возврат Неопределено;

	КонецЕсли;

КонецФункции

#КонецОбласти
